In [49]:
import pandas as pd
import numpy as np

In [50]:
date=pd.date_range(start="2024",periods=4,freq="D")
date

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04'], dtype='datetime64[ns]', freq='D')

In [51]:
data={
    "Date":date,
    "Event":['marrage','resiption','nameing','birthady'],
    "cost":[50000,35000,10000,5000]
}
df=pd.DataFrame(data)
print(df)

        Date      Event   cost
0 2024-01-01    marrage  50000
1 2024-01-02  resiption  35000
2 2024-01-03    nameing  10000
3 2024-01-04   birthady   5000

## a) add two new coloums discount,discountprize

In [52]:
df['Discount_prize']=df['cost']* 0.1
print(df)

        Date      Event   cost  Discount_prize
0 2024-01-01    marrage  50000          5000.0
1 2024-01-02  resiption  35000          3500.0
2 2024-01-03    nameing  10000          1000.0
3 2024-01-04   birthady   5000           500.0

In [53]:
df['discount']=df['cost'] -df['Discount_prize']
print(df)

        Date      Event   cost  Discount_prize  discount
0 2024-01-01    marrage  50000          5000.0   45000.0
1 2024-01-02  resiption  35000          3500.0   31500.0
2 2024-01-03    nameing  10000          1000.0    9000.0
3 2024-01-04   birthady   5000           500.0    4500.0

## b) add two more events data objects to the data

In [54]:
df.loc[len(df)] = {
    'Date': '2024-01-05',
    'Event': 'conference',
    'cost': 40000,
    'Discount_prize': 40000 * 0.1,     
    'discount': 40000 - 40000 * 0.1 
}

df.loc[len(df)] = {
    'Date': '2024-01-06',
    'Event': 'workshop',
    'cost': 15000,
    'Discount_prize': 15000 * 0.1,
    'discount': 15000 - 15000 * 0.1   
}

In [55]:
print(df)

                  Date       Event   cost  Discount_prize  discount
0  2024-01-01 00:00:00     marrage  50000          5000.0   45000.0
1  2024-01-02 00:00:00   resiption  35000          3500.0   31500.0
2  2024-01-03 00:00:00     nameing  10000          1000.0    9000.0
3  2024-01-04 00:00:00    birthady   5000           500.0    4500.0
4           2024-01-05  conference  40000          4000.0   36000.0
5           2024-01-06    workshop  15000          1500.0   13500.0

In [56]:
df=pd.read_csv('C:/Users/Guru Kiran/Downloads/students_basic.csv')
print(df)

  student_id   name department
0       S001    Anu        CSE
1       S002   Ravi        ECE
2       S003  Meena        CSE
3       S004  Kiran       MECH

In [57]:
df=pd.read_csv('C:/Users/Guru Kiran/Downloads/students_marks.csv')
print(df)

  student_id  math_marks  science_marks
0       S001          85             78
1       S002          90             88
2       S003          75             82
3       S005          80             79

In [73]:
import pandas as pd 
import numpy as np

In [74]:
df= pd.read_csv('C:/Users/Guru Kiran/Downloads/students_basic.csv')
df1= pd.read_csv('C:/Users/Guru Kiran/Downloads/students_marks.csv')

In [75]:
df

  student_id   name department
0       S001    Anu        CSE
1       S002   Ravi        ECE
2       S003  Meena        CSE
3       S004  Kiran       MECH

In [76]:
df1

  student_id  math_marks  science_marks
0       S001          85             78
1       S002          90             88
2       S003          75             82
3       S004          80             79

## a) mearge 2 data frame

In [4]:
df_merged = pd.merge(df, df1, on='student_id', how='inner')
print(df_merged)

NameError: name 'pd' is not defined

## b) add a new attribute called total marks by suming maths and science

In [79]:
df_merged['total_marks'] = df_merged['math_marks'] + df_merged['science_marks']

print(df_merged)

  student_id   name department  math_marks  science_marks  total_marks
0       S001    Anu        CSE          85             78          163
1       S002   Ravi        ECE          90             88          178
2       S003  Meena        CSE          75             82          157
3       S004  Kiran       MECH          80             79          159

## c) add a new data object to the final dataframe

In [80]:
new_row = {
    'student_id': 'S006',
    'name': 'Riya',
    'department': 'CSE',
    'math_marks': 88,
    'science_marks': 90,
    'total_marks': 178
}
df_merged = pd.concat([df_merged, pd.DataFrame([new_row])], ignore_index=True)
print(df_merged)

  student_id   name department  math_marks  science_marks  total_marks
0       S001    Anu        CSE          85             78          163
1       S002   Ravi        ECE          90             88          178
2       S003  Meena        CSE          75             82          157
3       S004  Kiran       MECH          80             79          159
4       S006   Riya        CSE          88             90          178

## d) save the final integrated dataframe to new file

In [81]:
df_merged.to_csv('C:/Users/Guru Kiran/Downloads/students_final.csv', index=False)

In [84]:
print(df_merged)

  student_id   name department  math_marks  science_marks  total_marks
0       S001    Anu        CSE          85             78          163
1       S002   Ravi        ECE          90             88          178
2       S003  Meena        CSE          75             82          157
3       S004  Kiran       MECH          80             79          159
4       S006   Riya        CSE          88             90          178